
### $leverage tf apply

```yaml
[19:16:16]    INFO Attempting to get temporary credentials for apps-devstg account.
[19:16:19]    INFO Using already configured temporary credentials.
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.nightly_backups.aws_backup_plan.ab_plan[0] will be created
  + resource "aws_backup_plan" "ab_plan" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "nightly_backups"
      + tags     = {
          + "Environment" = "apps-devstg"
          + "Name"        = "backups"
          + "Terraform"   = "true"
        }
      + tags_all = {
          + "Environment" = "apps-devstg"
          + "Name"        = "backups"
          + "Terraform"   = "true"
        }
      + version  = (known after apply)

      + rule {
          + completion_window        = 360
          + enable_continuous_backup = true
          + recovery_point_tags      = {
              + "Environment" = "apps-devstg"
              + "Name"        = "backups"
              + "Terraform"   = "true"
            }
          + rule_name                = "rule-1"
          + schedule                 = "cron(0 5 * * ? *)"
          + start_window             = 120
          + target_vault_name        = "Default"

          + lifecycle {
              + cold_storage_after = 0
              + delete_after       = 21
            }
        }
    }

  # module.nightly_backups.aws_backup_selection.ab_selection[0] will be created
  + resource "aws_backup_selection" "ab_selection" {
      + iam_role_arn  = (known after apply)
      + id            = (known after apply)
      + name          = "selection-by-tags"
      + not_resources = (known after apply)
      + plan_id       = (known after apply)

      + condition {
          + string_equals {
              + key   = (known after apply)
              + value = (known after apply)
            }

          + string_like {
              + key   = (known after apply)
              + value = (known after apply)
            }

          + string_not_equals {
              + key   = (known after apply)
              + value = (known after apply)
            }

          + string_not_like {
              + key   = (known after apply)
              + value = (known after apply)
            }
        }

      + selection_tag {
          + key   = "Backup"
          + type  = "STRINGEQUALS"
          + value = "True"
        }
    }

  # module.nightly_backups.aws_iam_policy.ab_tag_policy[0] will be created
  + resource "aws_iam_policy" "ab_tag_policy" {
      + arn         = (known after apply)
      + description = "AWS Backup Tag policy"
      + id          = (known after apply)
      + name        = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "backup:TagResource",
                          + "backup:ListTags",
                          + "backup:UntagResource",
                          + "tag:GetResources",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.nightly_backups.aws_iam_role.ab_role[0] will be created
  + resource "aws_iam_role" "ab_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "allow"
                      + Principal = {
                          + Service = [
                              + "backup.amazonaws.com",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aws-backup-plan-nightly_backups-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "apps-devstg"
          + "Name"        = "backups"
          + "Terraform"   = "true"
        }
      + tags_all              = {
          + "Environment" = "apps-devstg"
          + "Name"        = "backups"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.nightly_backups.aws_iam_role_policy_attachment.ab_policy_attach[0] will be created
  + resource "aws_iam_role_policy_attachment" "ab_policy_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSBackupServiceRolePolicyForBackup"
      + role       = "aws-backup-plan-nightly_backups-role"
    }

  # module.nightly_backups.aws_iam_role_policy_attachment.ab_restores_policy_attach[0] will be created
  + resource "aws_iam_role_policy_attachment" "ab_restores_policy_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSBackupServiceRolePolicyForRestores"
      + role       = "aws-backup-plan-nightly_backups-role"
    }

  # module.nightly_backups.aws_iam_role_policy_attachment.ab_tag_policy_attach[0] will be created
  + resource "aws_iam_role_policy_attachment" "ab_tag_policy_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "aws-backup-plan-nightly_backups-role"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.nightly_backups.aws_iam_role.ab_role[0]: Creating...
module.nightly_backups.aws_iam_policy.ab_tag_policy[0]: Creating...
module.nightly_backups.aws_backup_plan.ab_plan[0]: Creating...
module.nightly_backups.aws_iam_policy.ab_tag_policy[0]: Creation complete after 2s [id=arn:aws:iam::52********44:policy/terraform-20220607192*******00000001]
module.nightly_backups.aws_backup_plan.ab_plan[0]: Creation complete after 2s [id=78d33604-****-****-****-a653af7e6b73]
module.nightly_backups.aws_iam_role.ab_role[0]: Creation complete after 3s [id=aws-backup-plan-nightly_backups-role]
module.nightly_backups.aws_iam_role_policy_attachment.ab_restores_policy_attach[0]: Creating...
module.nightly_backups.aws_iam_role_policy_attachment.ab_tag_policy_attach[0]: Creating...
module.nightly_backups.aws_iam_role_policy_attachment.ab_policy_attach[0]: Creating...
module.nightly_backups.aws_backup_selection.ab_selection[0]: Creating...
module.nightly_backups.aws_iam_role_policy_attachment.ab_restores_policy_attach[0]: Creation complete after 0s [id=aws-backup-plan-nightly_backups-role-20220607******83000000003]
module.nightly_backups.aws_iam_role_policy_attachment.ab_tag_policy_attach[0]: Creation complete after 0s [id=aws-backup-plan-nightly_backups-role-2022060*******0000002]
module.nightly_backups.aws_iam_role_policy_attachment.ab_policy_attach[0]: Creation complete after 0s [id=aws-backup-plan-nightly_backups-role-2022060********00000004]
module.nightly_backups.aws_backup_selection.ab_selection[0]: Creation complete after 9s [id=ea44d163-****-****-****-5493efdd359c]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.
```
